[{"Header":"Meet new employee, Michael Elliott","Date":"Posted October 30, 12:00 AM","Summary":"Meet the newest member of the team in Center for Accessibility Resources, Michael Elliott, program assistant and accommodation coordinator. ","Link":"http://www.metrostate.edu/news/meet-new-employee-michael-elliott"},{"Header":"Additional sessions scheduled for Suicide Prevention Gatekeeper Training","Date":"Posted October 26, 12:00 AM","Summary":"Metropolitan State University is launching efforts to reduce and prevent suicide by providing gatekeeper training, which teach participants to recognize signs of distress in people and to connect that person to helpful resources. Three sessions and locations are offered for this training.","Link":"http://www.metrostate.edu/news/additional-sessions-scheduled-for-suicide-prevention-gatekeeper-training-10-26-17"},{"Header":"Metropolitan State University President addresses the tragedy in Mogadishu","Date":"Posted October 25, 12:00 AM","Summary":"Last week, we heard the terrible news about a massive bomb explosion in Mogadishu, Somalia that resulted in at least 358 deaths. This terrible and senseless attack, occurring more than 8,000 miles away, profoundly affects many of our neighbors, colleagues, students and their families. We feel their losses deeply and grieve with them.","Link":"http://www.metrostate.edu/news/metropolitan-state-university-president-addresses-the-tragedy-in-mogadishu"},{"Header":"Get Out the Vote for Election Day, Nov. 7","Date":"Posted October 24, 12:00 AM","Summary":"The effort to get out the vote continues on campus through Metro State Votes. Metro State Votes&#39; goal is to achieve 100-percent voter turnout among Metropolitan State University students every year through direct action.","Link":"http://www.metrostate.edu/news/get-out-the-vote-for-election-day-nov-7-10-24-17"},{"Header":"Metro State Votes: Early voting has begun","Date":"Posted October 12, 12:00 AM","Summary":"Early voting for 2017 municipal and school district elections has begun. Minnesota residents can cast ballots in person at their county election office, vote online, or vote by mail.","Link":"http://www.metrostate.edu/news/metro-state-votes-early-voting-has-begun-10-12-17"},{"Header":"Fanice Thomas named Health Policy Research Scholar","Date":"                                                              Posted October 12, 12:00 AM                                                      ","Summary":"Psychology alumna, Fanice Thomas, was selected to join a diverse group of 40 scholars from across the country to collaboratively tackle persistent health challenges by creating innovative solutions through their research.","Link":"http://www.metrostate.edu/news/fanice-thomas-named-health-policy-research-scholar-10-12-17"},{"Header":"Student Angela Edwards recognized with Minnesota Council of Nonprofits Unsung Hero Award","Date":"Posted October 9, 12:00 AM","Summary":"Student Angela Edwards was recently awarded a Minnesota Council of Nonprofits award for unsung heroes for her work with Education Explosion.","Link":"http://www.metrostate.edu/news/student-angela-edwards-recognized-with-minnesota-council-of-nonprofits-unsung-hero-award-10-9"},{"Header":"Early voting and same-day registration: It’s not too late","Date":"Posted October 9, 12:00 AM","Summary":"While mayoral elections in Minneapolis and Saint Paul are getting the most attention, other cities in the Twin Cities metro area will also elect new council members and mayors. Also, every school district in the Twin Cities  area will elect a new school board. To ensure your voice is heard this year, here are a few reminders.The first step is to see if you are registered to vote. ","Link":"http://www.metrostate.edu/news/early-voting-and-same-day-registration-its-not-too-late"}]