{"result":[{"header":"Metropolitan State University mourns Susan Shumer","summary":"Metropolitan State University mourns Susan Shumer, and President Ginny Arthur addresses the university with the following letter.","date":"Posted December 1, 12:00 AM","link":"http://www.metrostate.edu/news/metropolitan-state-university-mourns-susan-shumer-12-1-17"},{"header":"Metropolitan State teams compete at MinneMUDAC","summary":"On Saturday, Nov. 4, six teams from Metropolitan State University were among those competing at MinneMUDAC 2017. The annual data science competition gives teams a difficult challenge question and one month to analyze a massive dataset before presenting their results. This year, more than 60 teams participated at three levels, including Advanced Graduate, Advanced Undergraduate and Novice divisions.","date":"Posted November 22, 12:00 AM","link":"http://www.metrostate.edu/news/metropolitan-state-teams-compete-at-minnemudac-11-22-17"},{"header":"Holiday Giving Program","summary":"The Metropolitan State University community can be proud that for 17 years we have sponsored families in need over the holiday season. For the past five years, donations were made to families of our Metropolitan State students who were in need of help and support. The Student Parent Center is offering the Holiday Giving Program again this year and asking of the community's help.","date":"Posted November 13, 12:00 AM","link":"http://www.metrostate.edu/news/holiday-giving-program-11-13-17"},{"header":"Student Angela Edwards recognized with Minnesota Council of Nonprofits Unsung Hero Award","summary":"Angela Edwards was recently awarded a Minnesota Council of Nonprofits award for unsung heroes for her work with the nonprofit Education Explosion.","date":"Posted November 7, 12:00 AM","link":"http://www.metrostate.edu/news/student-angela-edwards-recognized-with-minnesota-council-of-nonprofits-unsung-hero-award"},{"header":"Meet new employee, Michael Elliott","summary":"Meet the newest member of the team in Center for Accessibility Resources, Michael Elliott, program assistant and accommodation coordinator.","date":"Posted October 30, 12:00 AM","link":"http://www.metrostate.edu/news/meet-new-employee-michael-elliott-10-30-17"},{"header":"Early voting and same-day registration: It’s not too late","summary":"November 7 is Election Day. It is less than a week away and Metropolitan State University is asking everyone to go out and vote. While mayoral elections in Minneapolis and Saint Paul are getting the most attention, other cities in the Twin Cities metro area will also elect new council members and mayors. Also, every school district in the Twin Cities area will elect a new school board.","date":"Posted October 27, 12:00 AM","link":"http://www.metrostate.edu/news/early-voting-and-same-day-registration-its-not-too-late-10-27-17"},{"header":"Additional sessions scheduled for Suicide Prevention Gatekeeper Training","summary":"Metropolitan State University is launching efforts to reduce and prevent suicide by providing gatekeeper training, which teach participants to recognize signs of distress in people and to connect that person to helpful resources. Three sessions and locations are offered for this training.","date":"Posted October 26, 12:00 AM","link":"http://www.metrostate.edu/news/additional-sessions-scheduled-for-suicide-prevention-gatekeeper-training-10-26-17"},{"header":"Metropolitan State University President addresses the tragedy in Mogadishu","summary":"Last week, we heard the terrible news about a massive bomb explosion in Mogadishu, Somalia that resulted in at least 358 deaths. This terrible and senseless attack, occurring more than 8,000 miles away, profoundly affects many of our neighbors, colleagues, students and their families. We feel their losses deeply and grieve with them.","date":"Posted October 25, 12:00 AM","link":"http://www.metrostate.edu/news/metropolitan-state-university-president-addresses-the-tragedy-in-mogadishu-10-25-17"}]}